cases/submerged/linear_z_neg/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |				
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10                                   	
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
	format		ascii;
	class		dictionary;
	object		fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
	default		CrankNicolson 0.7;
}

gradSchemes
{
	default		cellLimited leastSquares 1;
	grad(p)		cellLimited leastSquares 1;
}

divSchemes
{
	default 			none;
	div(phi,U)			Gauss linearUpwind grad(U);
	div(phi,k)			Gauss linearUpwind default;
	div(phi,omega)			Gauss linearUpwind default;
	div((nuEff*dev2(T(grad(U)))))	Gauss linear;
}

laplacianSchemes
{
	default		Gauss linear limited 1;
}

interpolationSchemes
{
	default 	linear;
}

snGradSchemes
{
	default		limited 1;
}

wallDist
{
	method		Poisson;
}

